In [1]:
import pandas as pd

In [4]:
import os
os.chdir('C:\\Users\\user\\Desktop')
os.getcwd()

'C:\\Users\\user\\Desktop'

In [6]:
d_f = pd.read_csv('연습.csv') # 넘파이 숫자연산에 좋음
d_f

    name  age        job
0   john   20    student
1  jenny   30  developer
2   nate   30    teacher
3  julia   40    dentist
4  brian   45    manager
5  chris   25     intern

In [7]:
d_f.head(2)

    name  age        job
0   john   20    student
1  jenny   30  developer

In [8]:
d_f.tail(2)

    name  age      job
4  brian   45  manager
5  chris   25   intern

In [9]:
type(d_f.name) # 시리즈는 리스트형태로 출력

pandas.core.series.Series

In [10]:
a = pd.core.series.Series( [1,2,3])

In [11]:
b =   pd.core.series.Series( ['one','two','three'])

In [12]:
pd.DataFrame(data = dict(Int = a , Str = b))

   Int    Str
0    1    one
1    2    two
2    3  three

### 파일을 불러오기 위해서는 경로설정 필수 마치 우리 사물함 같은 것 
- 내가 불러오고 싶은 것이 있으면 그것이 존재하는 위치를 정확하게 컴퓨터에 알려줘야 함
- 굳이 안해주고 하고 싶다면 불러올때마다 위치 적어줘야함 , 귀찮음

In [25]:
os.chdir('C:\\Users\\user\\Desktop\\판다스 기초\\pandas-master\data')
os.getcwd()

'C:\\Users\\user\\Desktop\\판다스 기초\\pandas-master\\data'

In [31]:
!pip show imbalanced-learn #깔려있는지확인

Name: imbalanced-learn
Version: 0.8.1
Summary: Toolbox for imbalanced dataset in machine learning.
Home-page: https://github.com/scikit-learn-contrib/imbalanced-learn
Author: None
Author-email: None
License: MIT
Location: c:\users\user\anaconda3\lib\site-packages
Requires: scipy, scikit-learn, joblib, numpy
Required-by:

In [32]:
!pip freeze scipy

alabaster==0.7.12
anaconda-client==1.7.2
anaconda-navigator==1.9.12
anaconda-project==0.8.3
argh==0.26.2
asn1crypto==1.3.0
astroid @ file:///C:/ci/astroid_1592487315634/work
astropy==4.0.1.post1
atomicwrites==1.4.0
attrs==19.3.0
autopep8 @ file:///tmp/build/80754af9/autopep8_1592412889138/work
Babel==2.8.0
backcall==0.2.0
backports.functools-lru-cache==1.6.1
backports.shutil-get-terminal-size==1.0.0
backports.tempfile==1.0
backports.weakref==1.0.post1
bcrypt==3.1.7
beautifulsoup4==4.9.1
bitarray @ file:///C:/ci/bitarray_1594751093906/work
bkcharts==0.2
bleach==3.1.5
bokeh @ file:///C:/ci/bokeh_1593178781838/work
boto==2.49.0
Bottleneck==1.3.2
brotlipy==0.7.0
certifi==2020.6.20
cffi==1.14.0
chardet==3.0.4
click==7.1.2
cloudpickle @ file:///tmp/build/80754af9/cloudpickle_1594141588948/work
clyent==1.2.2
collection==0.1.6
colorama==0.4.3
comtypes==1.1.7
conda==4.8.3
conda-build==3.18.11
conda-package-handling==1.7.0
conda-verify==3.4.2
contextlib2==0.6.0.post1
cryptography==2.9.2
cycler==0.10.0
Cython @ file:///C:/ci/cython_1594829190914/work
cytoolz==0.10.1
dask @ file:///tmp/build/80754af9/dask-core_1594156306305/work
decorator==4.4.2
defusedxml==0.6.0
diff-match-patch @ file:///tmp/build/80754af9/diff-match-patch_1594828741838/work
distributed @ file:///C:/ci/distributed_1594742844291/work
docutils==0.16
entrypoints==0.3
et-xmlfile==1.0.1
fastcache==1.1.0
filelock==3.0.12
flake8==3.8.3
Flask==1.1.2
fsspec==0.7.4
future==0.18.2
gevent @ file:///C:/ci/gevent_1593005471151/work
glob2==0.7
gmpy2==2.0.8
greenlet==0.4.16
h5py==2.10.0
HeapDict==1.0.1
html5lib @ file:///tmp/build/80754af9/html5lib_1593446221756/work
idna @ file:///tmp/build/80754af9/idna_1593446292537/work
imageio @ file:///tmp/build/80754af9/imageio_1594161405741/work
imagesize==1.2.0
imbalanced-learn==0.8.1
importlib-metadata @ file:///C:/ci/importlib-metadata_1593446511143/work
intervaltree @ file:///tmp/build/80754af9/intervaltree_1594361675072/work
ipykernel @ file:///C:/ci/ipykernel_1594745408489/work/dist/ipykernel-5.3.2-py3-none-any.whl
ipython @ file:///C:/ci/ipython_1593447482397/work
ipython-genutils==0.2.0
ipywidgets==7.5.1
isort==4.3.21
itsdangerous==1.1.0
jdcal==1.4.1
jedi @ file:///C:/ci/jedi_1592833825077/work
Jinja2==2.11.2
joblib @ file:///tmp/build/80754af9/joblib_1594236160679/work
json5==0.9.5
jsonschema==3.2.0
jupyter==1.0.0
jupyter-client @ file:///tmp/build/80754af9/jupyter_client_1594826976318/work
jupyter-console==6.1.0
jupyter-core==4.6.3
jupyterlab==2.1.5
jupyterlab-server @ file:///tmp/build/80754af9/jupyterlab_server_1594164409481/work
keyring @ file:///C:/ci/keyring_1593109799227/work
kiwisolver==1.2.0
lazy-object-proxy==1.4.3
libarchive-c==2.9
llvmlite==0.33.0+1.g022ab0f
locket==0.2.0
lxml @ file:///C:/ci/lxml_1594822774489/work
MarkupSafe==1.1.1
matplotlib @ file:///C:/ci/matplotlib-base_1592837548929/work
mccabe==0.6.1
menuinst==1.4.16
mistune==0.8.4
mkl-fft==1.1.0
mkl-random==1.1.1
mkl-service==2.3.0
mock==4.0.2
more-itertools==8.4.0
mpmath==1.1.0
msgpack==1.0.0
multipledispatch==0.6.0
navigator-updater==0.2.1
nbconvert==5.6.1
nbformat==5.0.7
networkx @ file:///tmp/build/80754af9/networkx_1594377231366/work
nltk @ file:///tmp/build/80754af9/nltk_1592496090529/work
nose==1.3.7
notebook==6.0.3
numba==0.50.1
numexpr==2.7.1
numpy==1.18.5
numpydoc @ file:///tmp/build/80754af9/numpydoc_1594166760263/work
olefile==0.46
openpyxl @ file:///tmp/build/80754af9/openpyxl_1594167385094/work
packaging==20.4
pandas @ file:///C:/ci/pandas_1592833613419/work
pandocfilters==1.4.2
paramiko==2.7.1
parso==0.7.0
partd==1.1.0
path==13.1.0
pathlib2==2.3.5
pathtools==0.1.2
patsy==0.5.1
pep8==1.7.1
pexpect==4.8.0
pickleshare==0.7.5
Pillow @ file:///C:/ci/pillow_1594298230227/work
pkginfo==1.5.0.1
pluggy==0.13.1
ply==3.11
prometheus-client==0.8.0
prompt-toolkit==3.0.5
psutil==5.7.0
py @ file:///tmp/build/80754af9/py_1593446248552/work
pycodestyle==2.6.0
pycosat==0.6.3
pycparser @ file:///tmp/build/80754af9/pycparser_1594388511720/work
pycurl==7.43.0.5
pydocstyle @ file:///tmp/build/80754af9/pydocstyle_1592848020240/work
pyflakes==2.2.0
Pygments==2.6.1
pylint @ file:///C:/ci/pylint_1592482039483/work
PyNaCl @ file:///C:/ci/pynacl_1595000047588/work
pyodbc===4.0.0-unsupported
pyOpenSSL @ file:///tmp/build/80754af9/pyopenssl_1594392929924/work
pyparsing==2.4.7
pyreadline==2.1
pyrsistent==0.16.0
PySocks==1.7.1
pytest==5.4.3
python-dateutil==2.8.1
python-jsonrpc-server @ file:///tmp/build/80754af9/python-jsonrpc-server_1594397536060/work
python-language-server @ file:///C:/ci/python-language-server_1594162130238/work
pytz==2020.1
PyWavelets==1.1.1
pywin32==227
pywin32-ctypes==0.2.0
pywinpty==0.5.7
PyYAML==5.3.1
pyzmq==19.0.1
QDarkStyle==2.8.1
QtAwesome==0.7.2
qtconsole @ file:///tmp/build/80754af9/qtconsole_1592848611704/work
QtPy==1.9.0
regex @ file:///C:/ci/regex_1593419644658/work
requests @ file:///tmp/build/80754af9/requests_1592841827918/work
rope==0.17.0
Rtree==0.9.4
ruamel-yaml==0.15.87
scikit-image==0.16.2
scikit-learn==1.0.1
scipy @ file:///C:/ci/scipy_1592916963468/work
seaborn==0.10.1
Send2Trash==1.5.0
simplegeneric==0.8.1
singledispatch==3.4.0.3
sip==4.19.13
six==1.15.0
sklearn==0.0
snowballstemmer==2.0.0
sortedcollections==1.2.1
sortedcontainers==2.2.2
soupsieve==2.0.1
Sphinx @ file:///tmp/build/80754af9/sphinx_1594223420021/work
sphinxcontrib-applehelp==1.0.2
sphinxcontrib-devhelp==1.0.2
sphinxcontrib-htmlhelp==1.0.3
sphinxcontrib-jsmath==1.0.1
sphinxcontrib-qthelp==1.0.3
sphinxcontrib-serializinghtml==1.1.4
sphinxcontrib-websupport @ file:///tmp/build/80754af9/sphinxcontrib-websupport_1593446360927/work
spyder @ file:///C:/ci/spyder_1594830825244/work
spyder-kernels @ file:///C:/ci/spyder-kernels_1594751670175/work
SQLAlchemy @ file:///C:/ci/sqlalchemy_1593445271541/work
statsmodels==0.11.1
sympy @ file:///C:/ci/sympy_1594234545115/work
tables==3.6.1
tblib==1.6.0
terminado==0.8.3
testpath==0.4.4
threadpoolctl @ file:///tmp/tmp9twdgx9k/threadpoolctl-2.1.0-py3-none-any.whl
toml @ file:///tmp/build/80754af9/toml_1592853716807/work
toolz==0.10.0
tornado==6.0.4
tqdm @ file:///tmp/build/80754af9/tqdm_1593446365756/work
traitlets==4.3.3
typing-extensions @ file:///tmp/build/80754af9/typing_extensions_1592847887441/work
ujson==1.35
unicodecsv==0.14.1
urllib3==1.25.9
watchdog @ file:///C:/ci/watchdog_1593447437088/work
wcwidth @ file:///tmp/build/80754af9/wcwidth_1593447189090/work
webencodings==0.5.1
Werkzeug==1.0.1
widgetsnbextension==3.5.1
win-inet-pton==1.1.0
win-unicode-console==0.5
wincertstore==0.2
wordcloud==1.8.1
wrapt==1.11.2
xlrd==1.2.0
XlsxWriter==1.2.9
xlwings==0.19.5
xlwt==1.3.0
xmltodict==0.12.0
yapf @ file:///tmp/build/80754af9/yapf_1593528177422/work
zict==2.0.0
zipp==3.1.0
zope.event==4.4
zope.interface==4.7.1

In [34]:
!conda list | grep pd #확인

'grep'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는
배치 파일이 아닙니다.

In [41]:
df = pd.read_csv('friend_list.csv',sep = ',')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [42]:
df.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [40]:
df.tail(3)

    name  age      job
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

In [43]:
an = pd.read_csv('asd.txt')
an

            1;t;aa;dsfa;231;4564;123456;789
0          2;a;tt;bdsd;243;7895;159167;dfsa
1  3;as;tat;tads;454;45646546;5644646;fadsa
2  4;df;dsf;afsd;4342;324325ds;fg5454;ggega

In [44]:
an = pd.read_csv('asd.txt',sep = ';')
an

   1   t   aa  dsfa   231      4564   123456    789
0  2   a   tt  bdsd   243      7895   159167   dfsa
1  3  as  tat  tads   454  45646546  5644646  fadsa
2  4  df  dsf  afsd  4342  324325ds   fg5454  ggega

In [46]:
ab = pd.read_csv('friend_list_tab.txt')
ab

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [45]:
ab = pd.read_csv('friend_list_tab.txt',sep = '\t')
ab

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [48]:
df = pd.read_csv('friend_list_no_head.csv') # 헤더 즉 변수명이 디폴트는 첫행이 들어가게 됨
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [50]:
df = pd.read_csv('friend_list_no_head.csv',header = None) # 헤더 즉 변수명이 디폴트는 첫행이 들어가게 됨
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [52]:
df.columns = ['name','age','job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [55]:
df = pd.read_csv('friend_list_no_head.csv',header = None, names = ['name','age','job'] )
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

### 딕셔너리 형태 만든 후 데이터 프레임으로 변경해주기

In [63]:
f_d_i = [
    {'a':'b' , 'ag':25 , 'j':'st'},
    {'a':'ab' , 'ag':30, 'j':'tea'}
]
df = pd.DataFrame(f_d_i)
df # 딕셔너리로 형태로 각각의 값을 따로따로 만들어줌

    a  ag    j
0   b  25   st
1  ab  30  tea

In [64]:
df = df[['j','ag','a']] # 키워드 형식으로 내가 원하는 순서대로 넣어줌
df

     j  ag   a
0   st  25   b
1  tea  30  ab

In [65]:
from collections import OrderedDict

In [67]:
fff = OrderedDict(
    [
        ('name',['John','Nate']),  
        ('age',[25,30]),
        ('job',['student','teacher']),
    ]
)
fff # 위의 셀과는 다르게 orderddict라는 함수로 딕셔너리 형태로 받으면서 한줄한줄 값을 지정해주지 않고 한번에 지정해줌

OrderedDict([('name', ['John', 'Nate']),
             ('age', [25, 30]),
             ('job', ['student', 'teacher'])])

In [68]:
df = pd.DataFrame.from_dict(fff)
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

### 리스트를 이용하여 데이터 프레임 만들기

In [69]:
fl = [
    ['john',20,'std'],
    ['nate',30,'tea']
]
fl

[['john', 20, 'std'], ['nate', 30, 'tea']]

In [70]:
column_name = ['name','age','job']
df = pd.DataFrame.from_records(fl,columns = column_name) # 데이터를 해주고 열이름 따로 지정해서 합치기
df

   name  age  job
0  john   20  std
1  nate   30  tea

In [78]:
fl = [
    ['name',['john','nate']],
    ['age',[20,30]],
    ['job',['std','nate']]
]

In [79]:
df = pd.DataFrame.from_items(fl)
3df #???

AttributeError: type object 'DataFrame' has no attribute 'from_items'

### 데이터 프레임 만들기

In [2]:
import pandas as pd
a = [ {'name':'a', 'age':20, 'job': 'student'},
     {'name':'b', 'age':30, 'job': None},
     {'name':'c', 'age':40, 'job': 'teacher'}
]
a = pd.DataFrame(a)
a

  name  age      job
0    a   20  student
1    b   30     None
2    c   40  teacher

In [4]:
import os
os.chdir('C:\\Users\\user\\Desktop\\판다스 기초\\pandas-master\data')
os.getcwd()

'C:\\Users\\user\\Desktop\\판다스 기초\\pandas-master\\data'

In [10]:
a.to_csv('exer.csv',index = True, header = True) #인덱스랑 헤드값은 디폴트로 저장

In [12]:
a.to_csv('exer.csv', na_rep = 'N/A') # na_rep를 통해 None값 즉 결측값을 딴걸로 해줄 수 있음

### 행 열 추출

In [17]:
f = [
    ['name',['john','jenny','nate']],   # 리스트 안의 리스트로 만들어서 데이터프레임으로 만듦
    ['age',[10,20,30]],,
    ['job',['student','developer','teacher']] # 하지마세요 그냥 items가 딕셔너리 적용인데 리스트에 적용안되는데 왜 이렇게하는지 의문
]
df = pd.DataFrame.from_items(f)
df

AttributeError: type object 'DataFrame' has no attribute 'from_items'

In [42]:
a = pd.DataFrame({ 'name' : ['john', 'jenny', 'nate'],
                  'age': [20,30,20],
                  'job' : ['stu','devel', 'tea']
})
a

    name  age    job
0   john   20    stu
1  jenny   30  devel
2   nate   20    tea

In [43]:
a[1:3]

    name  age    job
1  jenny   30  devel
2   nate   20    tea

In [44]:
df1 = a[1:3].copy() 
df1

    name  age    job
1  jenny   30  devel
2   nate   20    tea

### .loc location 위치추출 원하는 행을 추출해줌

In [45]:
a.loc[[0,2]] #범위가 아니라 0이랑 2인애

   name  age  job
0  john   20  stu
2  nate   20  tea

### 열추출

In [46]:
a[a.age > 25]

    name  age    job
1  jenny   30  devel

In [47]:
a.query('age > 20')

    name  age    job
1  jenny   30  devel

In [50]:
a[ (a.age >= 20) & (a.name == 'nate') ]

   name  age  job
2  nate   20  tea

In [51]:
a[ (a.age >= 25) & (a.name == 'nate') ]

Empty DataFrame
Columns: [name, age, job]
Index: []

### 인덱싱을 이용한 열 추출

In [52]:
a = [
    ['john', 20, 'stud'],
    ['jenny', 30, 'devel'],
    ['nate', 30, 'teach']
]
a = pd.DataFrame.from_records(a)
a

       0   1      2
0   john  20   stud
1  jenny  30  devel
2   nate  30  teach

### iloc를 이용하여 추출하는데
- [:,:] 앞에 :는 행추출 조건이거 ,콤마 뒤 : 콜론은 열추출조건
-[행조건(:).열조건(:)]

In [55]:
a.iloc[:,0:2]

       0   1
0   john  20
1  jenny  30
2   nate  30

### 변수명으로 추출

In [11]:
import pandas as pd
a = pd.read_csv('friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])

In [8]:
a

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [59]:
a1 = a[['age','name']]
a1

   age   name
0   20   John
1   30  Jenny
2   30   Nate
3   40  Julia
4   45  Brian
5   25  Chris

In [63]:
a2 = a.copy()
a2.filter(items = ['age','job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [65]:
a2.filter(keys = (['age','job'])) # 안됨

TypeError: filter() got an unexpected keyword argument 'keys'

### axis = 0이면 행적용 1이면 열적용

In [66]:
a2.filter(like = 'a', axis = 1) # 열이름에 a들어가는거 다 추출

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [69]:
a.filter(regex='b', axis = 1) #b로 끝나는 변수만 추출

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

In [10]:
a

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [15]:
import pandas as pd

f = [{'age':15 , 'job' : 'stud'},
    {'age':25 , 'job' : 'deve'},
    {'age':30 , 'job' : 'teac'}
]

df = pd.DataFrame(f,
                 index = ['john', 'jenny', 'nate'],
                 columns = ['age', 'job'])
df

       age   job
john    15  stud
jenny   25  deve
nate    30  teac

In [16]:
df.drop(['john', 'nate']) #drop을 이용하여 인덱스 버려줌 이때 axis는 디폴트 0
# 안담아짐 inplace이용하면 됨

       age   job
jenny   25  deve

In [18]:
df

       age   job
john    15  stud
jenny   25  deve
nate    30  teac

In [19]:
f = [{'name' : 'john', 'age':15, 'job' : 'student'},
     {'name' : 'ben', 'age':25, 'job' : 'develop'},
     {'name' : 'jenny', 'age':30, 'job' : 'teacher'}
]

df = pd.DataFrame(f,
                 columns = ['name','age','job'])
df

    name  age      job
0   john   15  student
1    ben   25  develop
2  jenny   30  teacher

In [21]:
df1 = df.copy()
df1.drop(df.index[[0,2]])

  name  age      job
1  ben   25  develop

In [22]:
df1.age > 20

0    False
1     True
2     True
Name: age, dtype: bool

In [23]:
df1[df1.age > 20]

    name  age      job
1    ben   25  develop
2  jenny   30  teacher

In [24]:
df1.drop('age', axis = 1)

    name      job
0   john  student
1    ben  develop
2  jenny  teacher

In [26]:
import pandas as pd
fdl = [{'name':'jone', 'age':15, 'job':'stude'},
       {'name':'jenny', 'age': 30, 'job':'devel'},
       {'name':'nate', 'age': 30, 'job':'tea'}
]
df = pd.DataFrame(fdl, columns = ['name', 'age', 'job'])
df

    name  age    job
0   jone   15  stude
1  jenny   30  devel
2   nate   30    tea

### 열추가

In [28]:
df['salary'] = 0
df

    name  age    job  salary
0   jone   15  stude       0
1  jenny   30  devel       0
2   nate   30    tea       0

In [29]:
import numpy as np

In [30]:
df['salary'] = np.where(df['job'] != 'stude' , 'yes', 'no') #넘파이 배열을 이용하여
df

    name  age    job salary
0   jone   15  stude     no
1  jenny   30  devel    yes
2   nate   30    tea    yes

In [60]:
a =  [{'name':'jone', 'midterm':95, 'final':85},
       {'name':'jenny', 'midterm': 85, 'final':80},
       {'name':'nate', 'midterm': 30, 'final':10}
]
df = pd.DataFrame(a, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   jone       95     85
1  jenny       85     80
2   nate       30     10

### 새로운 열 생성

In [61]:
df['total'] = df['midterm'] + df['final']
df

    name  midterm  final  total
0   jone       95     85    180
1  jenny       85     80    165
2   nate       30     10     40

In [62]:
df['average'] = df['total'] / 2
df

    name  midterm  final  total  average
0   jone       95     85    180     90.0
1  jenny       85     80    165     82.5
2   nate       30     10     40     20.0

In [63]:
grades = []

for i in df['average'] :
    if i >= 90:
        grades.append('a')
    elif i >= 70:
        grades.append('b')
    else:
        grades.append('c')

df['grade'] = grades
df

    name  midterm  final  total  average grade
0   jone       95     85    180     90.0     a
1  jenny       85     80    165     82.5     b
2   nate       30     10     40     20.0     c

In [64]:
def ab(a):
    if a != 'c':
        return 'pass'
    else:
        return 'fail'

In [65]:
df.grade = df.grade.apply(ab)
df

    name  midterm  final  total  average grade
0   jone       95     85    180     90.0  pass
1  jenny       85     80    165     82.5  pass
2   nate       30     10     40     20.0  fail

In [67]:
a = [{
    'yyyy-mm-dd' : '2000-06-27'},
    {'yyyy-mm-dd' : '2007-10-27'}
]
a = pd.DataFrame(a)
a

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [68]:
def yy(a):
    return a.split('-')[0] 
# 인덱싱을 이용하여 스플릿하면 2000, 06 ,27 되니까 첫번째 2000만 추출 2007도 마찬가지

In [71]:
a['year'] = a['yyyy-mm-dd'].apply(yy) # 연도만 추출

In [72]:
a

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

### 행 병합

In [73]:
a =  [{'name':'jone', 'midterm':95, 'final':85},
       {'name':'jenny', 'midterm': 85, 'final':80},
       {'name':'nate', 'midterm': 30, 'final':10}
]
df = pd.DataFrame(a, columns = ['name', 'midterm', 'final'])
df

    name  midterm  final
0   jone       95     85
1  jenny       85     80
2   nate       30     10

In [74]:
df2 = pd.DataFrame([
    ['ben',50,50]
], columns = ['name','midterm','final'])

In [75]:
df2

  name  midterm  final
0  ben       50     50

In [77]:
df.append(df2, ignore_index = True)

    name  midterm  final
0   jone       95     85
1  jenny       85     80
2   nate       30     10
3    ben       50     50

### 데이터 내 원하는 기준으로 그룹을 묶어주고싶음 groupby

In [78]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [81]:
cl = df.groupby('major') # 학과를 기준으로 그룹화
cl.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [82]:
    for name, group in cl:
        print(name + ": " + str(len(group))) ## 이름과 함게 몇명의 사람이 있는지 확인
        print(group)
        print()

Computer Science: 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics: 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics: 1
      name    major   sex
2  Abraham  Physics  male

Psychology: 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [84]:
df_major_cnt = pd.DataFrame({'count' : cl.size()}).reset_index()
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [87]:
groupby_sex = df.groupby('sex')

In [88]:
for name, group in groupby_sex:
    print(name + ": " + str(len(group)))
    print(group)
    print()

female: 6
        name             major     sex
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male: 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male

In [89]:
df_sex_cnt = pd.DataFrame({'count' : groupby_sex.size()}).reset_index()
df_sex_cnt

      sex  count
0  female      6
1    male      5

### 중복데이터 삭제(행) : .duplicated()

In [90]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [91]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [92]:
df = df.drop_duplicates()

In [93]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [95]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
dtype: bool

In [100]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Nate', 'major': None, 'sex': "male"},
                {'name': 'John', 'major': "Computer Science", 'sex': None},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [101]:
df.duplicated(['name']) # name변수에 들어간 값들이 중복된게 있냐?

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10     True
11     True
dtype: bool

In [102]:
df1 = df.copy()
df2 = df.copy()

- keep을 이용하여 뒤에 중복값은 유지하고 앞에 값 지워줘 keep = 'last'
- keep을 이용하여 앞에 중복값은 유지하고 뒤에 값 지워줘 keep = 'first'

In [103]:
df1.drop_duplicates(['name'], keep='last')  #존이 중복이였는데 앞에꺼 없어짐

        name             major     sex
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Nate              None    male
11      John  Computer Science    None

In [104]:
df2.drop_duplicates(['name'], keep='first') #존이 중복이였는데 뒤에꺼 없어짐

       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
2   Abraham           Physics    male
3     Brian        Psychology    male
4     Janny         Economics  female
5      Yuna         Economics  female
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
8      Zara        Psychology  female
9     Wendy         Economics  female

In [ ]:
### 결측, None값 처리 근데 여기서 데이터 탐색(EDA)의 감도 잡아보기

In [105]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [108]:
df.shape

(8, 3)

In [109]:
df.dtypes

name     object
job      object
age     float64
dtype: object

In [106]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [110]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

In [111]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

### none값을 0으로 변경하고싶어 , .fillna() 결측치를 채워줘

In [112]:
df1 = df.copy()
df1["age"] = df1["age"].fillna(0)
df1

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

- 0으로 설정하기 보다는 선생님의 중간 나이, 학생의 중간 나이로, 각각의 직업군에 맞게 Null값을 변경해줍니다.
- df2["age"].fillna <- age에 결측치 채워줄거다 선언해주고 이제 뭘로 채울건지 설명
- (df2.groupby("job")["age"]. <- 일단job으로 묶은 상태에서 age를 채워줄거야 선언
- transform("median"), inplace=True) <- 트랜스폼으로 중앙값해줘

In [115]:
df2 = df.copy()
df2["age"].fillna(df2.groupby("job")["age"].transform("median"), inplace=True)
df2

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

### apply함수 예제 활용
- 그냥 리스트형식으로 만들어서 하기 귀찮아서 바로 데이터프레임으로 만들어줬음

In [121]:
a = pd.DataFrame({ 'yyyy-mm-dd' : ['2000-08-27', '2002-09-24', '2005-12-20']
})
a

   yyyy-mm-dd
0  2000-08-27
1  2002-09-24
2  2005-12-20

In [122]:
def aaaa(ab):
    return ab.split('-')[0]

In [125]:
a['year'] = a['yyyy-mm-dd'].apply(aaaa)
a

   yyyy-mm-dd  year
0  2000-08-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

### age만들건데 올해 연도에서 year뺀거를 나이라고 하는데 그걸 어떻게 하냐

In [126]:
def aage(year,cc):
    return cc - int(year)

In [128]:
a['age'] = a['year'].apply(aage, cc = 2018)
a

   yyyy-mm-dd  year  age
0  2000-08-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13

### 매개변수 여러개받기, 자기소개 문장 만들어보기

In [129]:
def gg(ab,abc,abcd): 
    return abc + str(ab) +abcd

In [132]:
a['intro'] = a['age'].apply(gg, abc='나' ,abcd = '살이다')

In [133]:
a

   yyyy-mm-dd  year  age   intro
0  2000-08-27  2000   18  나18살이다
1  2002-09-24  2002   16  나16살이다
2  2005-12-20  2005   13  나13살이다

In [141]:
def ggg(a):
    return '나는 태어났다' + str(a.year) + ' 그리고 내 나이는 이거다' + str(a.age)

In [142]:
a.intro = a.apply(ggg, axis = 1)
a

   yyyy-mm-dd  year  age                        intro
0  2000-08-27  2000   18  나는 태어났다2000 그리고 내 나이는 이거다18
1  2002-09-24  2002   16  나는 태어났다2002 그리고 내 나이는 이거다16
2  2005-12-20  2005   13  나는 태어났다2005 그리고 내 나이는 이거다13

In [145]:
a['intro'] = a.apply(ggg, axis = 1) #같음
a

   yyyy-mm-dd  year  age                        intro
0  2000-08-27  2000   18  나는 태어났다2000 그리고 내 나이는 이거다18
1  2002-09-24  2002   16  나는 태어났다2002 그리고 내 나이는 이거다16
2  2005-12-20  2005   13  나는 태어났다2005 그리고 내 나이는 이거다13

### map apply map 활용

In [146]:
a = pd.DataFrame({ 'date' : ['2000-08-27', '2002-09-24', '2005-12-20']   
})
a

         date
0  2000-08-27
1  2002-09-24
2  2005-12-20

In [149]:
def aaa(d):
    return d.split('-')[0]

In [151]:
a['year'] = a['date'].map(aaa)
a

         date  year
0  2000-08-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [163]:
a = pd.DataFrame({'age' : [20,30,30],
                 'job' : ['student','developer','teacher']
                 })
a

   age        job
0   20    student
1   30  developer
2   30    teacher

In [164]:
a.job = a.job.map({'student' : 1, 'developer' : 2, 'teacher' : 3})
a

   age  job
0   20    1
1   30    2
2   30    3

In [165]:
a = pd.DataFrame({'x' : [5.5,-5.2,-1.6],
                 'y' : [-5.6,5.5,-4.5],
                  'z' : [-1.1,-2.2,-3.3]
                 })
a

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

In [166]:
import numpy as np

In [170]:
a = a.applymap(np.around)
a

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

In [171]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [173]:
### 단일값이 보고싶어 .unique()

In [172]:
df.job.unique()

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [174]:
df.job.value_counts()

teacher              8
student              5
lawyer               2
banker               2
basketball player    1
developer            1
dentist              1
Name: job, dtype: int64

### 데이터프레임 합치기 join(이너,레프트,라이트), 그냥 병합 merge

In [175]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [176]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [177]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

### 데이터 프레임 합치기 concat으로 그냥 합쳐주면 행병합 그니가 아래로 주르르륵합쳐짐

In [179]:
aaa = pd.concat([df1,df2])
aaa # 각각 데이터프레임 인덱스가 들어가서 보기싫음

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [180]:
aa = pd.concat([df1,df2], ignore_index = True)
aa #그냥 만들어진 데이터프레임의 인덱스순서대로 보여줘

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [182]:
a1 = df1.append(df2, ignore_index = True) #행으로 합쳐줌
a1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

### 이번에는 열병합으로 axis=1으로 열임을 선언해주면 오른쪽으로 쭉 붙음

In [185]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])
result = pd.concat([df1, df2], axis=1, ignore_index=True)

In [186]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Jack  developer

In [187]:
df2

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [189]:
aa = pd.concat([df1,df2],axis = 1, ignore_index=True)
aa

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

### 분석후 실제값 예측값분석할 때 혼동행렬 그냥 나중에 필요한거임

In [190]:
label = [1,2,3,4,5]
prediction = [1,2,2,5,5]

comparison = pd.DataFrame(
    {'label': label,
     'prediction': prediction
    })

comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           5
4      5           5